#+TITLE:XenHunt Config (org)
#+AUTHOR: Evgeny Berlizov (XenHunt)
#+DESCRIPTION: XenHunt's config of org
#+STARTUP: content
#+PROPERTY: header-args :tangle org-mine.el

** Org-Modern
:PROPERTIES:
:CUSTOM_ID: org-modern
:END:
#+begin_src emacs-lisp
(use-package org-modern
  :hook (org-mode . org-modern-mode)
  :custom
  (org-modern-hide-stars nil)		; adds extra indentation
  ;; (org-modern-table nil)
  (org-modern-list 
   '(;; (?- . "-")
     (?* . "•")
     (?+ . "‣")))
  (org-modern-block-name '("" . "")) ; or other chars; so top bracket is drawn promptly
  )
#+end_src

#+RESULTS:
: [nil 26321 35790 743497 nil elpaca-process-queues nil nil 928000 nil]

** Org-Modern-Indent
:PROPERTIES:
:CUSTOM_ID: org-modern-indent
:END:

=org-modern-indent= добавляет красивое выделение для блоков в =org=.

#+begin_src emacs-lisp
(use-package org-modern-indent
  :ensure (:host github :repo "jdtsmith/org-modern-indent")
  :after org-modern
  :config
  (add-hook 'org-mode-hook #'org-modern-indent-mode 90)
  )
#+end_src

#+RESULTS:
: [nil 26321 37179 983531 nil elpaca-process-queues nil nil 850000 nil]

** Org-Roam 
:PROPERTIES:
:CUSTOM_ID: org-roam
:END:

=org-roam= - это пакет, позволяющий создать полноценную систему заметок согласно методу =Zettelkasten=, использую лишь =org= файлы.

#+begin_src emacs-lisp
(use-package org-roam
  :defer 3
  :custom
  (org-roam-complete-everywhere t)
  :config
  (if (not (file-directory-p (file-truename "~/.org/roam")))
      (make-directory (file-truename "~/.org/roam")))
  (setq org-roam-directory "/home/berlizoves/.org/roam/")
  (setq org-roam-node-display-template "${title:*} ${tags:45}")
  (org-roam-db-autosync-enable)
  ;; (map! :leader
  ;;       (:prefix ("n r" . "org-roam")
  ;;                :desc "Completion at point"      "c" #'completion-at-point
  ;;                :desc "Find node"                "f" #'org-roam-node-find
  ;;                :desc "Show graph"               "g" #'org-roam-graph
  ;;                :desc "Insert node"              "i" #'org-roam-node-insert
  ;;                :desc "Create id for header"     "I" #'org-id-get-create
  ;;                :desc "Capture to node"          "n" #'org-roam-capture
  ;;                :desc "Toggle roam buffer"       "r" #'org-roam-buffer-toggle
  ;;                :desc "Start org-roam-ui in web" "u" #'org-roam-ui-mode
  ;;                :desc "Reload org-roam db"       "d" #'org-roam-db-sync
  ;;                :desc "Insert tag"               "t" #'org-roam-tag-add
  ;;                :desc "Remove tag"               "T" #'org-roam-tag-remove
  ;;                :desc "Add alias"                "a" #'org-roam-alias-add
  ;;                :desc "Remove alias"             "A" #'org-roam-alias-remove)
  ;;       (:prefix ("n j" . "org-roam-daily")
  ;;                :desc "Add today note entry"   "a" #'org-roam-dailies-capture-today
  ;;                :desc "Go to today note"       "A" #'org-roam-dailies-goto-today
  ;;                :desc "Add note entry by date" "d" #'org-roam-dailies-capture-date
  ;;                :desc "Go to note by date"     "D" #'org-roam-dailies-goto-date
  ;;                :desc "Find note in directory" "f" #'org-roam-dailies-find-directory
  ;;                ))
  (leader-key
    "n" '(:ignore t :wk "Org-Roam/Notes")
    ;; "n f" '(org-roam-node-find :wk "Find Node")
    "n g" '(org-roam-graph :wk "Show Graph")
    "n i" '(org-roam-node-insert :wk "Insert Node")
    "n I" '(org-id-get-create :wk "Create id for header")
    "n n" '(org-roam-node-find :wk "Find Node")
    "n r" '(org-roam-buffer-toggle :wk "Toggle roam buffer")
    "n u" '(org-roam-ui-mode :wk "Start org-roam-ui in web")
    "n d" '(org-roam-db-sync :wk "Reaload org-roam db")
    "n t" '(org-roam-tag-add :wk "Insert tag")
    "n T" '(org-roam-tag-remove :wk "Remove tag")
    "n a" '(org-roam-alias-add :wk "Add alias")
    "n A" '(org-roam-alias-remove :wk "Remove alias")
    ;; Dailies
    "n j" '(:ignore t :wk "Org-Roam-Dailies")
    "n j a" '(org-roam-dailies-capture-today :wk "Add today note entry")
    "n j A" '(org-roam-dailies-goto-today :wk "Go to today note")
    "n j d" '(org-roam-dailies-capture-date :wk "Add note entry by date")
    "n j D" '(org-roam-dailies-goto-date :wk "Go to note by date")
    )

  
  (setq org-roam-capture-templates
        '(
          ("d" "default" plain
           "%?"
           :if-new (file+head "%<%Y-%m-%d-%H:%M:%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n")
           :unnarrowed t)
          ("b" "book notes" plain
           (file "~/.org/roam/templates/book_notes_template.org")
           :if-new (file+head "%<%Y-%m-%d-%H:%M:%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n#+filetags: :Book_notes:\n#+pers_rating:\n")
           :unnarrowed t)
          ("m" "library or module of pr-ing language" plain
           (file "~/.org/roam/templates/programming_module_template.org")
           :if-new (file+head "%<%Y-%m-%d-%H:%M:%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n#+filetags: :Library:Programming:\n")
           :unnarrowed t
           )
          ("l" "lecture" plain
           (file "~/.org/roam/templates/lecture_template.org")
           :if-new (file+head "%<%Y-%m-%d-%H:%M:%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n#+filetags: :Lecture:\n")
           :unnarrowed t
           )
          ("B" "programming book notes" plain
           (file "~/.org/roam/templates/programming_book_template.org")
           :if-new (file+head "%<%Y-%m-%d-%H:%M:%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n#+filetags: :Book_notes:Programming:\n#+pers_rating:\n")
           :unnarrowed t
           )
          ("h" "habr article" plain
           (file "~/.org/roam/templates/habr_article_template.org")
           :if-new (file+head "%<%Y-%m-%d-%H:%M:%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n#+filetags: :Article:Programming:Habr:\n#+pers_rating:\n")
           :unnarrowed t
           )
          ("o" "definition" plain
           (file "~/.org/roam/templates/definition.org")
           :if-new (file+head "%<%Y-%m-%d-%H:%M:%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n")
           :unnarrowed t)
          ("t" "data type" plain
           (file "~/.org/roam/templates/data_type.org")
           :if-new (file+head "%<%Y-%m-%d-%H:%M:%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n#+filetags: :Data_Type:Programming:")
           :unnarrowed t)
          )         
        )
  
  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry "* %<%I:%M %p>\n%?"
           :if-new (file+head "%<%Y-%m-%d>.org" "#+title:%<%Y-%m-%d>\n#+filetags: :Dailies:"))))
  )
(elpaca-wait)
;; (use-package websoket

;;   :after org-roam)

(use-package org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
(elpaca-wait)
#+end_src

#+RESULTS:
| d | default | entry | * %<%I:%M %p> |

** Org-Sticky-Header
:PROPERTIES:
:CUSTOM_ID: org-sticky-header
:END:
#+begin_src emacs-lisp
(use-package org-sticky-header)
#+end_src

#+RESULTS:
: [nil 26321 39101 48239 nil elpaca-process-queues nil nil 512000 nil]
** Org-Transclusion
:PROPERTIES:
:CUSTOM_ID: org-transclusion
:END:
#+begin_src emacs-lisp
(use-package org-transclusion
  :after org
  :hook (org-mode . org-transclusion-mode)
  :init
  )
#+end_src

#+RESULTS:
: [nil 26321 40045 673291 nil elpaca-process-queues nil nil 408000 nil]

